#include <iostream>
#include <string>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	string a1 = "", a2 = "", a3 = "", a4 = "", a5 = "", a6 = "", a7 = "", a8 = "";
	int n, c1 = 0, c2 = 0, c3 = 0, c4 = 0, c5 = 0, c6 = 0, c7 = 0, c8 = 0;
	while (1) {
		cin >> n;
		if (n <= 10000000 && n >= 0) break;
		cout << "Число не подходит";
	}
	c1 = n % 10;
	c2 = n / 10 % 10;
	c3 = n / 100 % 10;
	c4 = n / 1000 % 10;
	c5 = n / 10000 % 10;
	c6 = n / 100000 % 10;
	c7 = n / 1000000 % 10;
	c8 = n / 10000000 % 10;
	if (c1 != 0 && c2 != 1) {
		if (c1 == 1) a1 = "один";
		if (c1 == 2) a1 = "два";
		if (c1 == 3) a1 = "три";
		if (c1 == 4) a1 = "четыре";
		if (c1 == 5) a1 = "пять";
		if (c1 == 6) a1 = "шесть";
		if (c1 == 7) a1 = "семь";
		if (c1 == 8) a1 = "восемь";
		if (c1 == 9) a1 = "девять";
	}
	if (c2 != 0 && c2 != 1) {
		if (c2 == 2) a2 = "двадцать ";
		if (c2 == 3) a2 = "тридцать ";
		if (c2 == 4) a2 = "сорок ";
		if (c2 == 5) a2 = "пятьдесят ";
		if (c2 == 6) a2 = "шестьдесять ";
		if (c2 == 7) a2 = "семьдесять ";
		if (c2 == 8) a2 = "восемьдесять ";
		if (c2 == 9) a2 = "девяносто ";
	}
	if (c2 == 1) {
		if (c1 == 1) a1 = "одинадцать ";
		if (c1 == 2) a1 = "двенадцать ";
		if (c1 == 3) a1 = "тринадцать ";
		if (c1 == 4) a1 = "четырнадцать ";
		if (c1 == 5) a1 = "пятнадцать ";
		if (c1 == 6) a1 = "шестнадцать ";
		if (c1 == 7) a1 = "семнадцать ";
		if (c1 == 8) a1 = "восемнадцать ";
		if (c1 == 9) a1 = "девятнацать ";
		if (c1 == 0) a2 = "десять ";
	}
	if (c3 != 0) {
		if (c3 == 1) a3 = "сто ";
		if (c3 == 2) a3 = "двести ";
		if (c3 == 3) a3 = "триста ";
		if (c3 == 4) a3 = "четыреста ";
		if (c3 == 5) a3 = "пятньсот ";
		if (c3 == 6) a3 = "шестьсот ";
		if (c3 == 7) a3 = "семьсот ";
		if (c3 == 8) a3 = "восемьсот ";
		if (c3 == 9) a3 = "девятьсот ";
	}
	if (c4 != 0 && c5 != 1) {
		if (c4 == 1) a4 = "одна тысяча ";
		if (c4 == 2) a4 = "две тысячи ";
		if (c4 == 3) a4 = "три тысячи ";
		if (c4 == 4) a4 = "четыре тысячи ";
		if (c4 == 5) a4 = "пять тысяч ";
		if (c4 == 6) a4 = "шесть тысяч";
		if (c4 == 7) a4 = "семь тысяч ";
		if (c4 == 8) a4 = "восемь тысяч ";
		if (c4 == 9) a4 = "девять тысяч ";
	}
	if (c5 != 0 && c5 != 1) {
		if (c5 == 2) a5 = "двадцать ";
		if (c5 == 3) a5 = "тридцать ";
		if (c5 == 4) a5 = "сорок ";
		if (c5 == 5) a5 = "пятьдесят ";
		if (c5 == 6) a5 = "шестьдесять ";
		if (c5 == 7) a5 = "семьдесять ";
		if (c5 == 8) a5 = "восемьдесять ";
		if (c5 == 9) a5 = "девяносто ";
		if (c4 == 0) a5 = a5 + "тысяч ";
	}
	if (c5 == 1) {
		if (c4 == 1) a4 = "одинадцать ";
		if (c4 == 2) a4 = "двенадцать ";
		if (c4 == 3) a4 = "тринадцать ";
		if (c4 == 4) a4 = "четырнадцать ";
		if (c4 == 5) a4 = "пятнадцать ";
		if (c4 == 6) a4 = "шестнадцать ";
		if (c4 == 7) a4 = "семнадцать ";
		if (c4 == 8) a4 = "восемнадцать ";
		if (c4 == 9) a4 = "девятнацать ";
		if (c4 == 0) a5 = "десять ";
	}
	if (c6 != 0) {
		if (c6 == 1) a6 = "сто ";
		if (c6 == 2) a6 = "двести ";
		if (c6 == 3) a6 = "триста ";
		if (c6 == 4) a6 = "четыреста ";
		if (c6 == 5) a6 = "пятньсот ";
		if (c6 == 6) a6 = "шестьсот ";
		if (c6 == 7) a6 = "семьсот ";
		if (c6 == 8) a6 = "восемьсот ";
		if (c6 == 9) a6 = "девятьсот ";
	}
	if (c7 != 0 && c8 != 1) {
		if (c7 == 1) a7 = "один миллион ";
		if (c7 == 2) a7 = "два миллиона ";
		if (c7 == 3) a7 = "три миллиона ";
		if (c7 == 4) a7 = "четыре миллиона ";
		if (c7 == 5) a7 = "пять миллионов ";
		if (c7 == 6) a7 = "шесть миллионов ";
		if (c7 == 7) a7 = "семь миллионов ";
		if (c7 == 8) a7 = "восемь миллионов ";
		if (c7 == 9) a7 = "девять миллионов ";
	}
	if (c8 == 1) a8 = "десять миллионов";
	cout << a8 + a7 + a6 + a5 + a4 + a3 + a2 + a1;
	return 0;
